feaser/openblt/stm32l5_port/Target/Source/ARMCM33_STM32L5/flash.c
  /* give the result back to the caller */
  return result;
} /*** end of FlashGetSectorIdx ***/


/************************************************************************************//**
** \brief     Determines the size of a flash pages, defined by hardware. This also
**            defines the minimal erase size.
** \return    Size of a flash page.
**
****************************************************************************************/
static blt_int32u FlashGetPageSize(void)
{
  blt_int32u result;

  /* evaluate bank mode to figure out the size of a flash page */
  if (FlashIsDualBankMode() == BLT_TRUE)
  {
    result = FLASH_PAGE_SIZE;
  }
  else
  {
    result = FLASH_PAGE_SIZE_128_BITS;
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetEraseSegmentSize ***/


/************************************************************************************//**
** \brief     Determines if the flash device is configured as dual bank mode or single
**            bank mode.
** \return    BLT_TRUE if configured as dual bank mode, BLT_FALSE for single bank mode.
**
****************************************************************************************/
static blt_bool FlashIsDualBankMode(void)
{
  blt_bool result = BLT_FALSE;

  /* evaluate DBANK bit to determine if dual bank mode is configured */
  if ((FLASH->OPTR & FLASH_OPTR_DBANK_Msk) != 0U)
  {
    /* update the result */
    result = BLT_TRUE;
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashIsDualBankMode ***/



/************************************************************************************//**
** \brief     Determines the flash bank that the address belongs to.
** \param     address Flash memory address.
** \return    FLASH_BANK_1 if the address belongs to bank 1, FLASH_BANK_2 otherwise.
**
****************************************************************************************/
static blt_int32u FlashGetBank(blt_addr address)
{
  blt_int32u result = FLASH_BANK_1;

  /* assert that the address is actually a valid flash address */
  ASSERT_RT(address >= FLASH_BASE);
  ASSERT_RT((address - FLASH_BASE) < FLASH_SIZE);

  /* bank 2 is only possible if configured for dual bank mode */
  if (FlashIsDualBankMode() == BLT_TRUE)
  {
    /* is the address in bank 2? */
    if ((address - FLASH_BASE) >= FLASH_BANK_SIZE)
    {
      /* update the result */
      result = FLASH_BANK_2;
    }
  }

  /* give the result back to the caller */
  return result;
} /** end of FlashGetBank ***/


/************************************************************************************//**
** \brief     Determines the flash page that the address belongs to.
** \param     address Flash memory address.
** \return    Page number.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u result = 0;

  /* assert that the address is actually a valid flash address */
  ASSERT_RT(address >= FLASH_BASE);
  ASSERT_RT((address - FLASH_BASE) < FLASH_SIZE);

  /* is the flash in single bank mode? */
  if (FlashIsDualBankMode() == BLT_FALSE)
  {
    /* determine the page number */
    result = (address - FLASH_BASE) / FlashGetPageSize();
  }
  /* flash is in dual page mode */
  else
  {
    /* does the address fall in the first bank? */
    if (FlashGetBank(address) == FLASH_BANK_1)
    {
      /* determine the page number */
      result = (address - FLASH_BASE) / FlashGetPageSize();
    }
    /* address falls in the second bank */
    else
    {
      /* determine the page number */
      result = (address - (FLASH_BASE + FLASH_BANK_SIZE)) / FlashGetPageSize();
    }
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPage ***/


/*********************************** end of flash.c ************************************/
